Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSelfIntersectingCurveLoopChain Property
 Curve elements forming a self-intersecting chain cannot be used as splitters and are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceSelfIntersectingCurveLoopChain { get; }
Public Shared ReadOnly Property DividedSurfaceSelfIntersectingCurveLoopChain As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceSelfIntersectingCurveLoopChain {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceSelfIntersectingCurveLoopChain : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace